Given the following configuration on provider v2.8, I'm unable to reproduce the issue you've raised. 

```hcl
variable "cloudflare_email" {}
variable "cloudflare_api_key" {}
variable "cloudflare_zone_id" {}

provider "cloudflare" {
  email   = var.cloudflare_email
  api_key = var.cloudflare_api_key
}

resource "cloudflare_record" "foo" {
  zone_id = var.cloudflare_zone_id
  name    = "@"
  value   = "test txt value"
  type    = "TXT"
  ttl     = "600"
}
```

```
$ terraform init && terraform apply -var "cloudflare_email=$CF_EMAIL" -var "cloudflare_api_key=$CF_API_KEY" -var "cloudflare_zone_id=$CF_ZONE_ID"

Initializing the backend...

Initializing provider plugins...

The following providers do not have any version constraints in configuration,
so the latest version was installed.

To prevent automatic upgrades to new major versions that may contain breaking
changes, it is recommended to add version = "..." constraints to the
corresponding provider blocks in configuration, with the constraint strings
suggested below.

* provider.cloudflare: version = "~> 2.8"

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_record.foo will be created
  + resource "cloudflare_record" "foo" {
      + created_on  = (known after apply)
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "@"
      + proxiable   = (known after apply)
      + proxied     = false
      + ttl         = 600
      + type        = "TXT"
      + value       = "test txt value"
      + zone_id     = "0da42c8d2132a9ddaf714f9e7c920711"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

cloudflare_record.foo: Creating...
cloudflare_record.foo: Creation complete after 1s [id=28a1be2c1071efe05a0a4d9d186a0189]
```

Subsequent runs do not trigger a replacement and the resource is managed as expected.

```
$ terraform apply -var "cloudflare_email=$CF_EMAIL" -var "cloudflare_api_key=$CF_API_KEY" -var "cloudflare_zone_id=$CF_ZONE_ID"
cloudflare_record.foo: Refreshing state... [id=28a1be2c1071efe05a0a4d9d186a0189]

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.
```

Can you please provide a full reproduction test case like the one I've posted above?

If you're encountering issues with importing and then attempting to manage DNS records, you can check out https://github.com/terraform-providers/terraform-provider-cloudflare/issues/735#issuecomment-658399736 which covers more about the issue and why it happens.